Tekla Open API Reference for Tekla Structures 2025
StructuresDialogAttribute Properties
The StructuresDialogAttribute type exposes the following members.
Properties
Name | Description
AttributeName
 Gets the attribute name of the property.
AttributeType
 Gets the attribute type of the property.
Top
See Also
Reference
StructuresDialogAttribute Class
Tekla.Structures.Dialog Namespace